### 0.3 Exploratory Data Analysis
**This notebook explores data from '../data/interim/'  **

##  Setup

In [1]:
# Libraries
import os
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

    
# Consistent Visuals
%matplotlib inline
pd.set_option('display.width', 600)
pd.set_option('display.max_columns', 100)
pd.set_option('display.notebook_repr_html', True)
sns.set(style="darkgrid")
sns.set_context("poster")

In [2]:
# Set working directory as root of project
os.chdir('..')

In [3]:
# Load raw data
df = pd.read_csv('data/interim/df_interim.csv')

# preview
df.tail()

      Unnamed: 0                    seller                      account_name                     company_name                plan
1368        1368  51f939de3e269e734300000a                Noble Jones Tours            Noble Jones Tours, LLC  blank_subscription
1369        1369  5075b4d1986ae5a003000003  DJ's Snowmobile Adventures, Inc.  DJ's Snowmobile Adventures, Inc  blank_subscription
1370        1370  57764d576864eabb438b45ae       Magic Carpet Glide - Denver                              NaN  blank_subscription
1371        1371  50775cef986ae51153000005                          Kimberly        Redwood Creek Buckarettes  blank_subscription
1372        1372  5207c447986ae59d7a000017                     Arctic Tropic                              NaN  blank_subscription

# Exploratory Data Analysis

In [4]:
# Descrive data
df.describe(include='all')

         Unnamed: 0                    seller account_name    company_name                plan
count   1373.000000                      1373         1373             934                1373
unique          NaN                      1373         1360             900                   6
top             NaN  51d4941d986ae57e46000057         Test  The Escape OKC  blank_subscription
freq            NaN                         1            3               5                 470
mean     686.000000                       NaN          NaN             NaN                 NaN
std      396.495271                       NaN          NaN             NaN                 NaN
min        0.000000                       NaN          NaN             NaN                 NaN
25%      343.000000                       NaN          NaN             NaN                 NaN
50%      686.000000                       NaN          NaN             NaN                 NaN
75%     1029.000000                       NaN          NaN             NaN                 NaN
max     1372.000000                       NaN          NaN             NaN                 NaN

In [5]:
# Missing Values
df.isnull().sum()

Unnamed: 0        0
seller            0
account_name      0
company_name    439
plan              0
dtype: int64

In [6]:
# Column info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1373 entries, 0 to 1372
Data columns (total 5 columns):
Unnamed: 0      1373 non-null int64
seller          1373 non-null object
account_name    1373 non-null object
company_name    934 non-null object
plan            1373 non-null object
dtypes: int64(1), object(4)
memory usage: 53.7+ KB